{
  "name": "Project",
  "meta": {
    "author": "",
    "email": " ",
    "tagline": "",
    "welcome": "Hi"
  },
  "rooms": [{
    "room1": {
      "alias": "Start Gate",
      "description": " You have messed up! You have gambled away your family's fortune and must aquire a new one before your wife finds out and castrates you.  You have heard legends of an adventurer who was lost with his treasure somewhere in this area.  You stumble your way into this clearing.  A path leads East and West",
      "contextualHelp": "Take a path!  Type east or south",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "room2",
        "south": "room17",
        "west": "-1",
        "climb up": "-1",
        "climb down": "-1"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room2": {
      "alias": "Clearing 2",
      "description": "You find a large clearing with a pile of sticks on the ground. Paths lead east, south and west",
      "contextualHelp": "Maybe those sticks will be helpful",
      "actions": {
        "get sticks": "you put the sticks in your pocket.  That seems pretty easy"
      },
      "exits": {
        "north": "-1",
        "east": "room3",
        "south": "room18",
        "west": "room1",
        "climb up": "-1",
        "climb down": "-1"
      },
      "objects": {
      "sticks": "you put the sticks in your pocket.  That seems pretty easy"
    },
      "enemies": null
    }
  }, {
    "room3": {
      "alias": "Cliff",
      "description": "You come across a large cliff.  Jumping is ill-advised.  Maybe you can climb down.  Or you can head back west",
      "contextualHelp": "climb down",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "-1",
        "south": "-1",
        "west": "room2",
        "climb up": "-1",
        "climb down": "room4"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room4": {
      "alias": "River Bank 1",
      "description": "You are on the river bank at the bottom of the cliff.  A bridge spans the trecherous river.  You can head south across the river, or you can climb back up",
      "contextualHelp": "cross the river to the south, or climb back up the cliff",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "-1",
        "south": "room6",
        "west": "-1",
        "climb up": "room3",
        "climb down": "-1"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room6": {
      "alias": "river bank2",
      "description": "You have made it across the river.  A fishing rod (called rod) was left on the groud.  You could take the fishing rod, but how would you store it?  Perhaps down your pant leg.  A path leads back north across the bridge, you can follow the river down a bit to the west, or you can climb up the cliff",
      "contextualHelp": "Follow the river or climb up.  Climbing seems exhausting though.",
      "actions": {
        "take rod": "you have picked up the fishing rod."
      },
      "exits": {
        "north": "room4",
        "east": "-1",
        "south": "-1",
        "west": "room7",
        "climb up": "room8"
      },
      "objects": {
        "rod": {
          "actions": null
        }
      },
      "enemies": null
    }
  }, {
    "room7": {
      "alias": "waterfall",
      "description": "You come to a raging waterfall.  What a beautiful sight.  You look out at the expanse in front of you, and contemplate what you have done.  Your wife will mutilate you if she discovers you gambled away all the money.  The water below looks inviting the more you think about it.  Maybe you should jump.  Or you can chicken out and head back east",
      "contextualHelp": "jump.",
      "actions": {
        "jump": "you jumped off of the top of the waterfall and plummeted to your certain death"
      },
      "exits": {
        "north": "-1",
        "east": "room6",
        "south": "-1",
        "west": "-1",

      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room8": {
      "alias": "clearing 3",
      "description": "You come across another clearing at the top of the cliff.  In the center is a tree stump with a dull axe in it.  That could be useful, though you would have to be careful not to cut off your foot. You can climb back down, or you can follow the path south. ",
      "contextualHelp": "Take the Axe and go South",
      "actions": {
        "take dull axe": "you have taken the dull axe."
      },
      "exits": {
        "north": "-1",
        "east": "-1",
        "south": "room9",
        "west": "-1",
        "climb down": "room6"
      },
      "objects": {
        "dull axe": {
          "actions": null
        }
      },
      "enemies": null
    }
  }, {
    "room9": {
      "alias": "forest gate",
      "description": "There is a guard guarding the gate he asks you what is 5 + 5 x 5 + 5 x 5/5?",
      "contextualHelp": "Learn Math, and answer correctly, or else.",
      "actions": {
        "answer ": "the guard allows you to proceed."
      },
      "exits": {
        "north": "room8",
        "east": "-1",
        "south": "-1",
        "west": "-1"
      },
      "objects": null,
      "actions": null,
      "enemies" : null
    }
  }, {
    "room10": {
      "alias": "village",
      "description": "You enter the nice village.  To the east lies the gate with the math nut.  south lies the blacksmith, which you should probably visit. To the west lies the mines. ",
      "contextualHelp": "Go to the blacksmith in the south before it is too late.  Then proceed to the mines in the west",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "room9",
        "south": "room11",
        "west": "room12"
      },
      "objects": null,
      "enemies": null
    }
    }, {
    "room11": {
      "alias": "Blacksmith",
      "description": "  The smithee looks long abandoned, with the coals buried in cold ash. You find a grindstone in the corner and a sword lying against a broken anvil.",
      "contextualHelp": "use the grindstone, and take the sword",
      "actions": {
        "take sword": "The rusty sword slips easily into your pocket in its entirety.  'It sure is weird that I can carry so much crap,' you think to yourself."
        ,
        "use grindstone": "Even sans an extensive knowledge of the art of smithing, you feel satisfied at the edge you have coaxed out of the pitted axe blade."
      },
      "exits": {
        "north": "room10",
        "east": "-1",
        "south": "-1",
        "west": "-1",
        "leave": "room10",
      },
      "objects": {
        "sword": {
          "actions": null
        }
      },
      "enemies": null
      }
      }, {
    "room12": {
      "alias": "Mine",
      "description": "  You enter the mineshaft, pushing down the feeling of suffocation.  You enter an open room, and through the kicked up coal dust you see a pickaxe resting against a pile of rubble and a faint light through a tunnel off to the north.",
      "contextualHelp": "Go north Stupid",
      "actions": {
        "take pickaxe": "Unable to stick the stout head of the pickaxe into your pocket like everything else, it takes residence in your waistband.  The splinters are disagreeable, but you persevere."
      },
      "exits": {
        "north": "room13",
        "east": "room10",
        "south": "-1",
        "west": "-1"
      },
      "objects": null,
      "enemies": null
    }
  }, {
  "room13": {
    "alias": "Clearing",
    "description": "  You enter a warm clearing, with a well-kept cottage to the south.  To the east leads down a long path with evenly spaced trees, which at some point in the distance merges with the vast forest.",
    "contextualHelp": "Jesus do you need help with everything?  enter the house!  Then continue north. This isn't rocket science! God!",
    "actions": null,
    "exits": {
      "north": "room15",
      "east": "-1",
      "south": "room12",
      "west": "-1",
      "enter house": "room14",
    },
    "objects": null,
    "enemies": null
  }
}, {
"room14": {
  "alias": "House",
  "description": "  The quaint dwelling looks inviting, however the walls and shelves are bare and the cabinets are all opened and empty.  Someone had picked up and left.  On the table lies some foodstuffs, including a head of lettuce, a carrot, and some strange-looking cooked meat.",
  "contextualHelp": "This house smells like death.  Take the food and leave",
  "actions": {
    "take lettuce": "With everything else you're holding, you realize that somehow storing a head of lettuce is the least of your worries.  The lettuce fits snugly into your pocket.",
    "take carrot": "Might come in handy.  Who knows?",
    "take meat": "It strangely smells a bit like Aunt Bertha, but you add it to your pocket regardless.  'If I get unbearably hungry...maybe.''"
  },
  "exits": {
    "north": "-1",
    "east": "-1",
    "south": "-1",
    "west": "-1",
    "leave house": "room13"
  },
  "objects": {
    "sword": {
      "actions": null
    }
  },
  "enemies": null
}
},{
"room15": {
  "alias": "Forest Path",
  "description": "  The path is thick with trees.  A tiny hut sits quaintly at the side of the road.",
  "contextualHelp": "Enter the hut, then continue north",
  "actions": null,
  "exits": {
    "north": "room17",
    "east": "-1",
    "south": "room13",
    "west": "-1",
    "enter hut": "room16"
  },
  "objects": null,
  "enemies": null
}
}, {
    "room16": {
      "alias": "Inside Hut",
      "description": "You Enter the Old hut.  The air is stale and there is not much around except for a polished stone and Some Rope.  You are anxious to leave.",
      "contextualHelp": "ooo a polished stone.  shiny",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "-1",
        "south": "-1",
        "west": "-1",
        "leave": "room15"
      },
      "objects": {
        "polished stone": null,
        "Rope": null,
      },
      "enemies": null
    }
  }, {
    "room17": {
      "alias": "Forest Crossroads",
      "description": "An interesting Four-Way Crossroads lays before you.  The paths lead in all four cardinal directions.",
      "contextualHelp": "To the east is a valid path, as well as to the west.  why waste your time going north or south?",
      "actions": null,
      "exits": {
        "north": "room1",
        "east": "room18",
        "south": "room15",
        "west": "room20"
      },
      "objects": {
        "bottle": {
          "actions": null
        }
      },
      "enemies": null
    }
  }, {
    "room18": {
      "alias": "Clearing With Abandoned House",
      "description": "After cutting down the entire forest, you come across (made?) a clearing with a house in the corner.  There is a path north and a path back west.  Upon closer inspection, you find the house wide open, but in a state of disrepair.  You are apprehensize about entering, but then remember that the last time you raided a house, you found all sorts of goodies, and only a minor owl infestation.  You could enter this house...",
      "contextualHelp": "Maybe you should check out the house?  if you haven't already been here.  maybe you will find saplings to replace the forest you just clear cut",
      "actions": null,
      "exits": {
        "north": "room2",
        "east": "-1",
        "south": "-1",
        "west": "room17",
        "enter": "room19"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room19": {
      "alias": "Inside Abandoned House",
      "description": "You have entered the house, and to your relief there does not seem to be any owls.  You look around, but nearly soil yourself when you see someone looking at you.  You are taken aback, but then you see the truth.  The body is dead, and in its clutch is some sort of small magic box, upon which is an image of an apple with a bite taken out, and the words 4s written below it.  You are confused by this thing.  You consider prying the small metal box from the corpse's grip...",
      "contextualHelp": "What the hell is an iphone?  It is locked, but at least you can use the flashlight function",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "-1",
        "south": "-1",
        "west": "-1",
        "leave":"room18"
      },
      "objects":
      {
        "iphone": "You place it in your pocket, careful not to scratch the screen against the many sharp objects you keep in your pockets, dangerously close to your skin, and others"
      },
      "enemies": null
    }
  }, {
    "room20": {
      "alias": "Cave Entrance",
      "description": "You come across a cave opening, but it is blocked by rocks.  You could go back east, or you could break up the rocks, but with what splintery tool?...",
      "contextualHelp": "Destroy the rocks, enter the cave.  Let's get this party started! ",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "room17",
        "south": "-1",
        "west": "room21"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room21": {
      "alias": "Cave Cavern",
      "description": "You find a large opening in the cave, with a few paths around.  You could go back east, head south or west. It seems like a warm draft comes from the southern path.",
      "contextualHelp": "Look around, pick a path (south?)",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "room20",
        "south": "room22",
        "west": "room23"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room22": {
      "alias": "Cave Bed",
      "description": "A large opening, with hay all over the floor, almost like something has been sleeping here for a while.  It seems warm, but you don't have time for a nap.  There is also a large, sturdy wooden plank on the floor.  The only exit is back the way you came, to the north.",
      "contextualHelp": "Take the planks.  It could be useful",
      "actions": null,
      "exits": {
        "north": "room21",
        "east": "-1",
        "south": "-1",
        "west": "-1"
      },
      "objects": {
        "sturdy board": "this giant plank might come in handy.  Good thing it fits in my pocket!"
      },
      "enemies": null
    }
  }, {
    "room23": {
      "alias": "Fissure",
      "description": "A large fissure has opened up in the groud.  You could try jumping, but you are weighed down by all your stuff, and you doubt you could make it anyways on your bad knees and beer loving body.  You could lay something across the expanse that you could walk over...or you could turn back, but you've come this far aleady!",
      "contextualHelp": "use the plank",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "room21",
        "south": "-1",
        "west": "-1",
        "use plank": "room24"
      },
      "objects": null,
      "enemies": null
    }
  }, {
    "room24": {
      "alias": "Rabbit's Gate",
      "description": "You find, what appears to be near the end of the cave, a small opening.  You attempt to approach, but a small, innocent-looking rabbit blocks your way.  you try to get around the animal, but it is a persistant little fuzzball, and you can't get by.  How would you get by?  You could always try to kill the rabbit, but you could also try distracting the rabbit by throwing some food.  What to do...",
      "contextualHelp":"What to do, what to do?",
      "actions": null,
      "exits": {
        "north": "-1",
        "east": "room23",
        "south": "-1",
        "west": "-1"
      },
      "objects": null,
      "enemies": {
        "rabbit": {
          "actions": [{
            "throw": {
              "meat": "You have distracted the rabbit as it chows down on the aunt bertha meat.  You run past to the next room",
              "room": "room25"
            }
          },{
            "kill": "The rabbit kills you.  Did you really think this was a normal rabbit?"
            }]
        }
      }
    }
  }, {
    "room25": {
      "alias": "Treasure Room",
      "description": "Having run past the rabbit, you come across the final room of the cave.  What??!! There is the treasure you have been searching for!  Why would it be here?  Oh well.  You rush for the treausure. But there is a body slumped next to the chest!  And it reeks of Elderberries.  You look a little closer, and you see something written on the wall.  Is that blood? You shine the light from your magic box at the wall, and it reads 'Do NOT feed the rabbit.  It will want more...' You feel a cold chill run down your spine, and as you turn your head, you see small, beady red eyes leering at you.  You reach for your sword.  Time for a showdown!",
      "contextualHelp": "What do I expect now?  That's easy.  I expect you to die",
      "actions": null,
      "isExitRoom" : "true",
      "exits": {
        "north": "-1",
        "east": "-1",
        "south": "-1",
        "west": "-1"
      },
      "objects": null,
      "enemies": null
    }
  }]
}
  }]
}
